Revit 2026 API

# AnalysisDisplayDiagramSettings Properties

---

The AnalysisDisplayDiagramSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FenceType | Type of diagram fence visualization. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OutlineColor | Color of outline and fence lines in the diagram. |
|  | OutlineLineWeight | Line weight of outline and fence lines in the diagram. |
|  | Rounding | Increment to which numeric values of analysis results are rounded in diagram. |
|  | TextLabelType | Type of diagram text label visualization. |
|  | TextTypeId | Element id of text associated with the settings. |
|  | Transparency | Transparency percentage of diagram color fill |

#### Reference

AnalysisDisplayDiagramSettings Class

Autodesk.Revit.DB.Analysis Namespace